app/Models/Utility.php

select * from `settings` where `created_by` = 2
---
    public static function getSettingById($id)
    {
        if (self::$getsettingsid == null) {
            $data = DB::table('settings');
            $data = $data->where('created_by', '=', $id)->get();